yulei/vendor_sdk/nuvoton/M480_BSP_CMSIS_V3.05.003/SampleCode/StdDriver/HSUSBD_RNDIS/rndis.c
        case REMOTE_NDIS_HALT_MSG:
            break;

        default:
            ;
    }
}

extern uint32_t My_EMAC_SendPkt(uint8_t *pu8Data, uint32_t u32Size);
void RNDIS_ProcessOutData(void)
{
    uint32_t size = *(uint32_t *)((uint32_t) &rndis_outdata[u32CurrentTxBuf][0xC]);
    uint32_t offset = size + 44;

    HSUSBD_ENABLE_EP_INT(EPB, HSUSBD_EPINTEN_RXPKIEN_Msk | HSUSBD_EPINTEN_SHORTRXIEN_Msk);
    if (gRndisOutData)
    {
__retry_mac_tx_:
        if (outdatalen >= offset)
        {
            if (My_EMAC_SendPkt(&rndis_outdata[u32CurrentTxBuf][rndis_outdata[u32CurrentTxBuf][8] + 8], size) == 1)
            {
                // data successfully hook to EMAC descriptor, use next free buffer
                u32CurrentTxBuf++;
                if (u32CurrentTxBuf == EMAC_TX_DESC_SIZE + 1)
                    u32CurrentTxBuf = 0;
                if ((outdatalen - offset) > 0)
                {
                    size = *(uint32_t *)((uint32_t) &rndis_outdata[u32CurrentTxBuf-1][offset+0xC]);
                    memcpy(&rndis_outdata[u32CurrentTxBuf][0],&rndis_outdata[u32CurrentTxBuf-1][offset], size);
                    outdatalen -= offset;
                    if (My_EMAC_SendPkt(&rndis_outdata[u32CurrentTxBuf][rndis_outdata[u32CurrentTxBuf][8] + 8], size) == 1)
                    {
                        u32CurrentTxBuf++;
                        if (u32CurrentTxBuf == EMAC_TX_DESC_SIZE + 1)
                            u32CurrentTxBuf = 0;
                    }
                }
                gRndisOutData = 0;
                outdatalen = 0;
                u32TxCnt++;
            }
            else
            {
                HSUSBD_ENABLE_EP_INT(EPB, 0);
                goto __retry_mac_tx_;
            }
        }
    }
}

void RNDIS_InData(unsigned int u32PktLen)
{
    uint32_t *ptr = (uint32_t *)rndis_indata[u32CurrentRxBuf];
    uint32_t msglen;

    *(ptr+1) = msglen = u32PktLen + 44;  /* message len = data len + 44 */
    *(ptr+3) = u32PktLen;                /* data len */

    /* active usbd DMA to send data to FIFO */
    HSUSBD_SET_DMA_READ(BULK_IN_EP_NUM);
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk|HSUSBD_BUSINTEN_SUSPENDIEN_Msk|HSUSBD_BUSINTEN_RSTIEN_Msk|HSUSBD_BUSINTEN_VBUSDETIEN_Msk);
    HSUSBD_SET_DMA_ADDR((uint32_t)rndis_indata[u32CurrentRxBuf]);
    HSUSBD_SET_DMA_LEN(msglen);
    g_hsusbd_DmaDone = 0;
    g_hsusbd_ShortPacket = 1;
    HSUSBD_ENABLE_DMA();

    /* wait usbd dma complete */
    while (1)
    {
        if (g_hsusbd_DmaDone)
            break;

        if (!HSUSBD_IS_ATTACHED())
            break;

        if ((HSUSBD->DMACTL & HSUSBD_DMACTL_DMAEN_Msk) == 0)
            break;
    }
    while (HSUSBD->EP[EPA].EPDATCNT & 0xFFFF)
    {
        if (!HSUSBD_IS_ATTACHED())
            return;
    }
}

void RNDIS_IsAvaiable(void)
{
    static int volatile acnt = 0;

    if (acnt++ == 0)
    {
        linkStatus = EMAC_CheckLinkStatus();
    }
    acnt &= 0x1ff;

    if (linkStatus == EMAC_LINK_DOWN)
    {
        HSUSBD->EP[EPC].EPDAT = 0x00000000;   /* 1: avaiable; 0: not */
    }
    else
    {
        HSUSBD->EP[EPC].EPDAT = 0x00000001;   /* 1: avaiable; 0: not */
    }
    HSUSBD->EP[EPC].EPDAT = 0x00000000;
    HSUSBD->EP[EPC].EPTXCNT = 8;
}


void RNDIS_ProcessQueryOID(uint32_t oid)
{
    int volatile i;
    uint32_t *ptr = (uint32_t *)rndis_response;

    switch (oid)
    {
        case OID_GEN_SUPPORTED_LIST:
        {
            uint32_t len = sizeof(rndis_oidbuffer);
            *(ptr+1) = 24 + len;        /* message len */
            *(ptr+4) = len;             /* InformationBufferLength */
            *(ptr+5) = 0x10;            /* InformationBufferOffset */
            for (i=0; i<len/4; i++)
                *(ptr+6+i) = rndis_oidbuffer[i];
            break;
        }
        case OID_GEN_HARDWARE_STATUS:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 0;       /* NdisHardwareStatusReady */
            break;

        case OID_GEN_MEDIA_SUPPORTED:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 0;       /* NdisMedium802_3 */
            break;

        case OID_GEN_MEDIA_IN_USE:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 0;       /* NdisMedium802_3 */
            break;

        case OID_GEN_MAXIMUM_FRAME_SIZE:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 1500;    /* 1500 */
            break;

        case OID_GEN_LINK_SPEED:
            linkStatus = EMAC_CheckLinkStatus();
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            if((linkStatus == EMAC_LINK_100F) || (linkStatus == EMAC_LINK_100H)) {
                *(ptr+6) = 1000000; /* 100Mbps */
            } else if((linkStatus == EMAC_LINK_10F) || (linkStatus == EMAC_LINK_10H)) {
                *(ptr+6) = 100000;  /* 10Mbps */
            } else {
                *(ptr+6) = 0;  /* disconnected */
            }
            break;

        case OID_GEN_TRANSMIT_BLOCK_SIZE:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 1500;    /* 1518 */
            break;

        case OID_GEN_RECEIVE_BLOCK_SIZE:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 1500;    /* 1518 */
            break;

        case OID_GEN_VENDOR_ID:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 0xFFFFFF;  /* Vendors without an IEEE-registered code should use this value */
            break;

