yulei/vendor_sdk/nuvoton/M480_BSP_CMSIS_V3.05.003/SampleCode/StdDriver/HSUSBD_RNDIS/rndis.c
        case OID_GEN_VENDOR_DESCRIPTION:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 'N';
            *(ptr+6) = 'V';
            *(ptr+6) = 'T';
            *(ptr+6) = 0x00;
            break;

        case OID_GEN_MAXIMUM_TOTAL_SIZE:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 0x00000616;  /* 1558 */
            break;

        case OID_GEN_MEDIA_CONNECT_STATUS:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            if(linkStatus == EMAC_LINK_DOWN)
                *(ptr+6) = 0x00000001;  /* NdisMediaStateDisconnected */
            else
                *(ptr+6) = 0x00000000;  /* NdisMediaStateConnected */
            break;

        case OID_GEN_VENDOR_DRIVER_VERSION:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 0x00000001;
            break;

        case OID_GEN_XMIT_OK:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = u32TxCnt;
            break;

        case OID_GEN_RCV_OK:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = u32RxCnt;
            break;

        case OID_GEN_XMIT_ERROR:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 0x00000000;
            break;

        case OID_GEN_RCV_ERROR:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 0x00000000;
            break;

        case OID_GEN_RCV_NO_BUFFER:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 0x00000000;
            break;

        case OID_802_3_PERMANENT_ADDRESS:
            *(ptr+1) = 24+6;    /* message len = 24 + info len */
            *(ptr+4) = 6;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            for (i=0; i<6; i++)
                rndis_response[24+i] = g_au8MacAddr[i];
            break;

        case OID_802_3_CURRENT_ADDRESS:
            *(ptr+1) = 24+6;    /* message len = 24 + info len */
            *(ptr+4) = 6;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            for (i=0; i<6; i++)
                rndis_response[24+i] = g_au8MacAddr[i];
            break;

        case OID_802_3_MAXIMUM_LIST_SIZE:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 0x00000001;
            break;
        case OID_GEN_PHYSICAL_MEDIUM:
            *(ptr+1) = 24+4;    /* message len = 24 + info len */
            *(ptr+4) = 4;       /* InformationBufferLength */
            *(ptr+5) = 0x10;    /* InformationBufferOffset */
            *(ptr+6) = 0x00000000;
            break;
        default:
            ;
    }
}

void RNDIS_ProcessSetOID(uint32_t oid)
{
    int volatile i;
    uint32_t *ptr = (uint32_t *)rndis_response;

    switch (oid)
    {
        case OID_GEN_CURRENT_PACKET_FILTER:
            *(ptr+1) = 0x10;        /* TODO: message len */
            break;

        case OID_802_3_MULTICAST_LIST:
            *(ptr+1) = 0x10;        /* TODO: message len */
            break;

        default:
            ;
    }
}

/*** (C) COPYRIGHT 2019 Nuvoton Technology Corp. ***/
